INSERT INTO clients (first_name, last_name, phone, email, birth_date, address)
VALUES ('Светлана', 'Иванова', '+79012345678', 'sveta@mail.ru', '1989-12-02', 'г. Казань, ул. Тверская, д.3'),
('Мария', 'Попова', '+79012840078', 'mari@mail.ru', '2009-01-10', 'г. Казань, ул. Пушкина, д.18'),
('Иван', 'Селиванов', '+79123456789', 'vanya@mail.ru', '2001-06-05', 'г. Москва, ул. Ленина, д.25'),
('Егор', 'Мельников', '+79000236579', 'egor@mail.ru', '1993-07-07', 'г. Казань, ул. Танковая, д.15');


INSERT INTO trainers (first_name, last_name, specialization, phone, email)
VALUES ('Елена', 'Суркина', 'Плавание', '+79012940068', 'elena@mail.ru'),
('Тимофей', 'Орлов', 'Волейбол', '+79892541058', 'tim@mail.ru'),
('Екатерина', 'Воронина', 'Пилатес', '+79222945295', 'katya@mail.ru');


INSERT INTO gyms (name, capacity, floor)
VALUES ('Зал А', 20, 1),
('Зал B', 15, 2),
('Зал C', 10, 2),
('Зал D', 25, 3),
('Бассейн', 30, 1);


INSERT INTO workouts (title, trainer_id, hall_id, start_time, duration_min)
VALUES ('Пилатес для начинающих', 3, 2, '2026-09-12 10:00:00', 60),
('Плавание для взрослых', 1, 5, '2026-09-18 17:00:00', 45),
('Волейбол', 2, 1, '2026-09-02 16:00:00', 90),
('Пилатес для начинающих', 3, 2, '2026-08-22 11:00:00', 60),
('Волейбол', 2, 1, '2026-08-07 16:30:00', 90);


INSERT INTO visits (client_id, workout_id, visit_date, rating)
VALUES (1, 3, '2026-09-02', 5),
(2, 1, '2026-09-12', 4),
(3, 4, '2026-08-22', 5),
(4, 2, '2026-09-18', 5),
(1, 5, '2026-08-07', 4);